src/cf/Enums/ОбработчикиДрайверовПодключаемогоОборудования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ОбработчикиДрайверовПодключаемогоОборудования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Обработчик1СWebСервисОборудование</Name>
					<Comment>WebСервисОборудование</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработчик1СДисплейПокупателя</Name>
					<Comment>ДисплейПокупателя</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработчик1СККМOffline</Name>
					<Comment>ККМOffline</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработчик1СПринтерЧеков</Name>
					<Comment>ПринтерЧеков</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработчик1СРарусФискальныеРегистраторыМебиус</Name>
					<Comment>ФискальныйРегистратор</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработчик1СРарусФискальныеРегистраторыФеликс</Name>
					<Comment>ФискальныйРегистратор</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработчик1ССканерыШтрихкода</Name>
					<Comment>СканерШтрихкода</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработчик1ССканерыШтрихкодаNative</Name>
					<Comment>СканерШтрихкода</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработчик1ССчитывателиМагнитныхКарт</Name>
					<Comment>СчитывательМагнитныхКарт</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработчик1ССчитывателиМагнитныхКартNative</Name>
					<Comment>СчитывательМагнитныхКарт</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработчик1СФискальныйРегистраторЭмулятор</Name>
					<Comment>ФискальныйРегистратор</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработчик1СЭквайринговыеТерминалыСбербанк</Name>
					<Comment>ЭквайринговыйТерминал</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикACOMВесыСПечатьюЭтикеток</Name>
					<Comment>ВесыСПечатьюЭтикеток</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикARCUS2ЭквайринговыеТерминалыIngenico</Name>
					<Comment>ЭквайринговыйТерминал</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикCASВесыСПечатьюЭтикеток</Name>
					<Comment>ВесыСПечатьюЭтикеток</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикCASЭлектронныеВесы</Name>
					<Comment>ЭлектронныеВесы</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикERFIDСчитывательRFID</Name>
					<Comment>СчитывательRFID</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикIboxProПоддержкаMPosЭквайринга</Name>
					<Comment>ЭквайринговыйТерминал</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикIronLogicСчитывателиБесконтактныхКарт</Name>
					<Comment>СчитывательМагнитныхКарт</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикISBCСчитывательRFID</Name>
					<Comment>СчитывательRFID</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикRightScanТерминалыСбораДанных</Name>
					<Comment>ТерминалСбораДанных</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикTRPOSЭквайринговыеТерминалы</Name>
					<Comment>ЭквайринговыйТерминал</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикUCSEFTPOSЭквайринговыеТерминалы</Name>
					<Comment>ЭквайринговыйТерминал</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикАТОЛВесыСПечатьюЭтикеток8X</Name>
					<Comment>ВесыСПечатьюЭтикеток</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикАтолДисплеиПокупателя</Name>
					<Comment>ДисплейПокупателя</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикАтолДисплеиПокупателя8X</Name>
					<Comment>ДисплейПокупателя</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикАтолККМOffline</Name>
					<Comment>ККМOffline</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикАтолККТ54ФЗ</Name>
					<Comment>ККТ</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикАтолККТ54ФЗ9X</Name>
					<Comment>ККТ</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикАтолСканерыШтрихкода</Name>
					<Comment>СканерШтрихкода</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикАтолСканерыШтрихкода8X</Name>
					<Comment>СканерШтрихкода</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикАтолСчитывателиМагнитныхКарт</Name>
					<Comment>СчитывательМагнитныхКарт</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикАтолСчитывателиМагнитныхКарт8X</Name>
					<Comment>СчитывательМагнитныхКарт</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикАтолТерминалыСбораДанных</Name>
					<Comment>ТерминалСбораДанных</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикАтолТерминалыСбораДанныхMobileLogistics</Name>
					<Comment>ТерминалСбораДанных</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикАтолФискальныеРегистраторы</Name>
					<Comment>ФискальныйРегистратор</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикАтолФискальныеРегистраторы8X</Name>
					<Comment>ФискальныйРегистратор</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикАтолФискальныеРегистраторыУниверсальный</Name>
					<Comment>ФискальныйРегистратор</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикАтолЭлектронныеВесы</Name>
					<Comment>ЭлектронныеВесы</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикАтолЭлектронныеВесы8X</Name>
					<Comment>ЭлектронныеВесы</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикВерсияТФискальныеРегистраторы</Name>
					<Comment>ФискальныйРегистратор</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикГАЗПРОМБАНКЭквайринговыеТерминалы</Name>
					<Comment>ЭквайринговыйТерминал</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикГексагонПринтераЭтикеток</Name>
					<Comment>ПринтерЭтикеток</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикГексагонСканерыШтрихкода</Name>
					<Comment>СканерШтрихкода</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикГексагонТерминалыСбораДанных</Name>
					<Comment>ТерминалСбораДанных</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикДримкасФискальныеРегистраторыVikiPrint</Name>
					<Comment>ФискальныйРегистратор</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикИНПАСЭквайринговыеТерминалыSmart</Name>
					<Comment>ЭквайринговыйТерминал</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикИНПАСЭквайринговыеТерминалыUNIPOS</Name>
					<Comment>ЭквайринговыйТерминал</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикИскраФискальныеРегистраторыПрим</Name>
					<Comment>ФискальныйРегистратор</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикККСДисплеиПокупателя</Name>
					<Comment>ДисплейПокупателя</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикККСФискальныеРегистраторы</Name>
					<Comment>ФискальныйРегистратор</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикКлеверенсСчитывателиRFID</Name>
					<Comment>СчитывательRFID</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикКлеверенсТерминалыСбораДанных</Name>
					<Comment>ТерминалСбораДанных</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикКристаллСервисДисплеиПокупателяVikiVision</Name>
					<Comment>ДисплейПокупателя</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикКристаллСервисФискальныеРегистраторыPirit</Name>
					<Comment>ФискальныйРегистратор</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикМассаКВесыСПечатьюЭтикеток</Name>
					<Comment>ВесыСПечатьюЭтикеток</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикМассаКЭлектронныеВесы</Name>
					<Comment>ЭлектронныеВесы</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикОРИОНФискальныеРегистраторы</Name>
					<Comment>ФискальныйРегистратор</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикСБРФЭквайринговыеТерминалы</Name>
					<Comment>ЭквайринговыйТерминал</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикСканкодДисплеиПокупателя</Name>
					<Comment>ДисплейПокупателя</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикСканкодПринтераЭтикетокGodexEZPL8Native</Name>
					<Comment>ПринтерЭтикеток</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикСканкодСканерыШтрихкода</Name>
					<Comment>СканерШтрихкода</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикСканкодСчитывательRFIDCipherLab</Name>
					<Comment>СчитывательRFID</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикСканкодТерминалыСбораДанных</Name>
					<Comment>ТерминалСбораДанных</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикСканкодТерминалыСбораДанныхNative</Name>
					<Comment>ТерминалСбораДанных</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикСканситиПринтераЭтикеток</Name>
					<Comment>ПринтерЭтикеток</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикСканситиТерминалыСбораДанных</Name>
					<Comment>ТерминалСбораДанных</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикШтрихМВесыСПечатьюЭтикеток</Name>
					<Comment>ВесыСПечатьюЭтикеток</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикШтрихМДисплеиПокупателя</Name>
					<Comment>ДисплейПокупателя</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикШтрихМККМOffline</Name>
					<Comment>ККМOffline</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикШтрихМККТ54ФЗ</Name>
					<Comment>ККТ</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикШтрихМПлатежныйТерминалYarus</Name>
					<Comment>ЭквайринговыйТерминал</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикШтрихМТерминалыСбораДанных</Name>
					<Comment>ТерминалСбораДанных</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикШтрихМФискальныеРегистраторы</Name>
					<Comment>ФискальныйРегистратор</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикШтрихМФискальныеРегистраторыУниверсальный</Name>
					<Comment>ФискальныйРегистратор</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикШтрихМЭлектронныеВесы</Name>
					<Comment>ЭлектронныеВесы</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/CommonModules/МенеджерОборудованияКлиентПереопределяемый/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Возвращает текущую дату, приведенную к часовому поясу сеанса.
// Предназначена для использования вместо функции ТекущаяДата().
//
// Возвращаемое значение:
//  Результат - текущая дата.
//
Функция ДатаСеанса() Экспорт
	
	Возврат ТекущаяДата();
	
КонецФункции

// Функция возвращает объект обработчика драйвера по его наименованию.
//
// Параметры:
//  ОбработчикДрайвера  - Перечисление, ссылка на обработчик драйвера подключаемого оборудования.
//  ЗагружаемыйДрайвер  - Булево, признак, что драйвер загружаемый
//  ТипОборудованияИмя  - Строка, представление типа оборудования
//
// Возвращаемое значение:
//  Результат - Используемый модуль обработчика драйвера.
//
Функция ПолучитьОбработчикДрайвера(ОбработчикДрайвера, ЗагружаемыйДрайвер, ТипОборудованияИмя) Экспорт

 // Используем универсальный обработчик драйвера по стандарту "1С:Совместимо".
#Если ВебКлиент Тогда
	Результат = ПодключаемоеОборудованиеУниверсальныйДрайверАсинхронноКлиент; 
#Иначе
	Результат = ПодключаемоеОборудованиеУниверсальныйДрайверКлиент;
#КонецЕсли
	
	// Обработчики драйверов не удовлетворяющие стандарту "1С:Совместимо".
	Если Не ЗагружаемыйДрайвер И ОбработчикДрайвера <> Неопределено Тогда
		
		// Сканеры штрихкода
		Если ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.Обработчик1ССканерыШтрихкода") Тогда
			Возврат ПодключаемоеОборудование1ССканерыШтрихкодаКлиент;
		ИначеЕсли ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикСканкодСканерыШтрихкода") Тогда
			Возврат ПодключаемоеОборудованиеСканкодСканерыШтрихкодаКлиент;
		ИначеЕсли ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикАтолСканерыШтрихкода") Тогда
			Возврат ПодключаемоеОборудованиеАтолСканерыШтрихкодаКлиент;
		КонецЕсли;
		// Конец Сканеры штрихкода
		
		// Фискальные регистраторы
		Если ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикАтолФискальныеРегистраторы") Тогда
			Возврат ПодключаемоеОборудованиеАтолФискальныеРегистраторыКлиент;
		ИначеЕсли ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикВерсияТФискальныеРегистраторы") Тогда
			Возврат ПодключаемоеОборудованиеВерсияТФискальныеРегистраторыКлиент;
		ИначеЕсли ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикККСФискальныеРегистраторы") Тогда
			Возврат ПодключаемоеОборудованиеККСФискальныеРегистраторыКлиент;
		ИначеЕсли ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикШтрихМФискальныеРегистраторы") Тогда
			Возврат ПодключаемоеОборудованиеШтрихМФискальныеРегистраторыКлиент;
		ИначеЕсли ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикОРИОНФискальныеРегистраторы") Тогда
			Возврат ПодключаемоеОборудованиеОРИОНФискальныеРегистраторыКлиент;
		КонецЕсли;
		// Конец Фискальные регистраторы.
		
		// Эквайринговые терминалы
		Если ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикСБРФЭквайринговыеТерминалы") Тогда
			Возврат ПодключаемоеОборудованиеСБРФЭквайринговыеТерминалыКлиент;
		ИначеЕсли ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикИНПАСЭквайринговыеТерминалыSmart") Тогда
			Возврат ПодключаемоеОборудованиеИНПАСЭквайринговыеТерминалыSmartКлиент;
		КонецЕсли;
		// Конец Эквайринговые терминалы.
		 
		// ККМ offline
		Если ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикАтолККМOffline") Тогда
			Возврат ПодключаемоеОборудованиеАтолККМOfflineКлиент;
		ИначеЕсли ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикШтрихМККМOffline") Тогда
			Возврат ПодключаемоеОборудованиеШтрихМККМOfflineКлиент;
		ИначеЕсли ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.Обработчик1СККМOffline") Тогда
			Возврат ПодключаемоеОборудование1СККМOfflineКлиент;
		КонецЕсли;
		// Конец ККМ offline
		
		// Web-сервис оборудование
		Если ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.Обработчик1СWebСервисОборудование") Тогда
			Возврат Неопределено;
		КонецЕсли;
		// Конец Web-сервис оборудование
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Процедура отправляет электронное сообщение на электронную почта и абонентский номер.
//
Процедура НачатьОтправкуЭлектронногоЧека(ПараметрыЧека, ТекстСообщения, ПокупательEmail, ПокупательНомер) Экспорт
	
	РассылкаЭлектронныхЧековКлиент.НачатьОтправкуЭлектронногоЧека(ПараметрыЧека, ТекстСообщения, ПокупательEmail, ПокупательНомер);
	
КонецПроцедуры

// Переопределяет формируемый шаблон чека.
Функция СформироватьШаблонЧека(ВходныеПараметры, ДополнительныйТекст, СтандартнаяОбработка, ТипОборудования = "") Экспорт

КонецФункции

#КонецОбласти
 
#Область РаботаСФормойЭкземпляраОборудования

// Дополнительные переопределяемые действия с управляемой формой в Экземпляре оборудования
// при событии "ПриОткрытии".
//
Процедура ЭкземплярОборудованияПриОткрытии(Объект, ЭтаФорма, Отказ) Экспорт
	
КонецПроцедуры

// Дополнительные переопределяемые действия с управляемой формой в Экземпляре оборудования
// при событии "ПередЗакрытием".
//
Процедура ЭкземплярОборудованияПередЗакрытием(Объект, ЭтаФорма, Отказ, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

// Дополнительные переопределяемые действия с управляемой формой в Экземпляре оборудования
// при событии "ПередЗаписью".
//
Процедура ЭкземплярОборудованияПередЗаписью(Объект, ЭтаФорма, Отказ, ПараметрыЗаписи) Экспорт
	
	Ошибки = Неопределено;
	
	Если (НЕ ЗначениеЗаполнено(Объект.Организация))
		И Объект.ТипОборудования <> ПредопределенноеЗначение("Перечисление.ТипыПодключаемогоОборудования.СканерШтрихкода")
		И Объект.ТипОборудования <> ПредопределенноеЗначение("Перечисление.ТипыПодключаемогоОборудования.СчитывательRFID") Тогда
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "Организация", НСтр("ru='Не указана организация'"), Неопределено);
	КонецЕсли;
	
	Если (НЕ ЗначениеЗаполнено(ЭтаФорма.Склад))
		И (Объект.ТипОборудования = ПредопределенноеЗначение("Перечисление.ТипыПодключаемогоОборудования.ККМOffline")
		ИЛИ Объект.ТипОборудования = ПредопределенноеЗначение("Перечисление.ТипыПодключаемогоОборудования.WebСервисОборудование")) Тогда
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "Склад", НСтр("ru='Не указан склад (розничный магазин)'"), Неопределено);
	КонецЕсли;
	
	Если Ошибки <> Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки, Отказ);
	КонецЕсли;
	
	ПараметрыЗаписи.Вставить("Организация", Объект.Организация);
	ПараметрыЗаписи.Вставить("Склад", ЭтаФорма.Склад);
	ПараметрыЗаписи.Вставить("УзелОбмена", ЭтаФорма.УзелОбмена);
КонецПроцедуры

// Дополнительные переопределяемые действия с управляемой формой в Экземпляре оборудования
// при событии "ПослеЗаписи".
//
Процедура ЭкземплярОборудованияПослеЗаписи(Объект, ЭтаФорма, ПараметрыЗаписи) Экспорт
	
	Если ПараметрыЗаписи.Свойство("НужноОбновитьИнтерфейс") Тогда
		ОбновитьИнтерфейс();
	КонецЕсли;
	
КонецПроцедуры

// Дополнительные переопределяемые действия с управляемой формой в Экземпляре оборудования
// при событии "ТипОборудованияОбработкаВыбора".
//
Процедура ЭкземплярОборудованияТипОборудованияВыбор(Объект, ЭтаФорма, ЭтотОбъект, Элемент, ВыбранноеЗначение) Экспорт
	
	Если ВыбранноеЗначение = ПредопределенноеЗначение("Перечисление.ТипыПодключаемогоОборудования.ККМOffline")
		ИЛИ ВыбранноеЗначение = ПредопределенноеЗначение("Перечисление.ТипыПодключаемогоОборудования.WebСервисОборудование") Тогда
		ЭтаФорма.ОрганизацияВидимость = Истина;
		ЭтаФорма.Элементы.Организация.АвтоОтметкаНезаполненного = Истина;
		ЭтаФорма.Элементы.Склад.АвтоОтметкаНезаполненного = Истина;
		ЭтаФорма.Элементы.Склад.ПодсказкаВвода = НСтр("ru='Укажите розничный магазин'");
	ИначеЕсли ВыбранноеЗначение = ПредопределенноеЗначение("Перечисление.ТипыПодключаемогоОборудования.СканерШтрихкода")
		ИЛИ  ВыбранноеЗначение = ПредопределенноеЗначение("Перечисление.ТипыПодключаемогоОборудования.СчитывательRFID") Тогда
		Объект.Организация = ПредопределенноеЗначение("Справочник.Организации.ПустаяСсылка");
		ЭтаФорма.ОрганизацияВидимость = Ложь;
		ЭтаФорма.Элементы.Организация.АвтоОтметкаНезаполненного = Ложь;
		ЭтаФорма.Элементы.Склад.ПодсказкаВвода = НСтр("ru='Если оборудование используется в розничном магазине'");
		ЭтаФорма.Элементы.Склад.АвтоОтметкаНезаполненного = Ложь;
		ЭтаФорма.Элементы.Склад.ОтметкаНезаполненного = Ложь;
	Иначе
		ЭтаФорма.ОрганизацияВидимость = Истина;
		ЭтаФорма.Элементы.Организация.АвтоОтметкаНезаполненного = Истина;
		ЭтаФорма.Элементы.Склад.ПодсказкаВвода = НСтр("ru='Если оборудование используется в розничном магазине'");
		ЭтаФорма.Элементы.Склад.АвтоОтметкаНезаполненного = Ложь;
		ЭтаФорма.Элементы.Склад.ОтметкаНезаполненного = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСФормойНастройкиWebServiceОборудования

// Дополнительные переопределяемые действия с управляемой формой в Форме настройки Web-сервис оборудования
// при событии "ПриСозданииНаСервере".
//
Процедура ФормаНастройкиWebСервисОборудованияПриОткрытии(Идентификатор, ЭтаФорма, Отказ) Экспорт
	
КонецПроцедуры

#КонецОбласти
